abandon
abandoned
abolish
about
absence
absolute
absorb
abstract
absurd
abuse
academic
accent
accept
access
accessible
accidental
accidentally
according to
account
accuracy
accuse
ache
acid
acquire
act
action
active
actively
activity
actual
actually
adapt
add
addict
addicted
addiction
addition
additional
additionally
adequate
adequately
adjust
adjustment
admiration
admire
admission
admittedly
adopt
adopted
adoption
advance
adventurous
advertising
affair
affect
affection
after
again
against
aggressive
aggressively
agree
agreement
agriculture
ahead
aim
air
aircraft
alike
alone
along
alter
alternative
alternatively
altogether
aluminium
always
amazement
ambassador
ambition
ambitious
among
amongst
amuse
amused
amusement
analyse
analysis
analyst
ancestor
anger
animal
annually
anxiety
anxious
anxiously
anyhow
anything
anywhere
apart
apostrophe
apparent
apparently
appeal
appear
appearance
application
apply
appreciate
appreciation
approach
appropriate
appropriately
approval
approve
approximate
area
argue
argument
armed
around
arrange
arrangement
arrest
arrogant
arrow
art
artificial
artificially
artistic
as
ashamed
aside
ask
aspect
assess
assessment
assist
assistance
associate
association
assume
assure
astonished
astonishing
astonishment
atmosphere
atom
atomic
attached
attachment
attempt
attention
attract
attractive
aubergine
authority
automatic
automatically
availability
average
award
aware
away
awful
awkward
back
background
backup
badge
badly
bad-tempered
bakery
balance
balanced
bang
bank
banker
banking
bare
barely
bargain
bark
barrier
base
basement
basically
basics
basis
battle
beam
bear
beat
beg
begin
behalf
behind
belief
believe
bell
belong
belongings
bench
bend
beneath
beneficial
benefit
berry
best
bestseller
betray
beyond
bikini
billion
birth
bit
bite
bitter
bizarre
blade
blame
blank
blink
block
bloody
blow
blush
board
boast
boiling
bold
boldly
bomber
bombing
bond
bonus
boost
bossy
bother
bothered
bounce
bow
bra
bracket
brake
branch
brand
bravery
break
breakable
breakdown
breakthrough
breathtaking
breed
brick
brief
bright
brightly
brilliantly
bring
broadband
broadcast
broken
brother-in-law
browse
bruise
brush
budget
bug
bulb
bullet
bump
bumper
bun
burglar
burglary
burgle
burn
burst
bury
bush
business
by
cabinet
cable
cake
calculate
calculation
call
calm
calmly
camp
campus
can
candidate
canned
capable
capacity
captain
capture
carbon
carbon dioxide
carbon footprint
carbon monoxide
cardboard
cardigan
care
carelessly
carelessness
caring
carnival
carry
case
cast
casual
casually
catalogue
catch
category
catering
cause
cautious
cease
cell
cellar
cello
cemetery
centigrade
certain
certainty
chain
challenge
chance
chaos
character
characteristic
charge
charm
chart
chase
chat
cheat
cheeky
cheer
cheerful
cheerfully
Cheers!
chemical
cherry
chest
chew
chief
childish
chill
chimney
chip
choir
chop
circle
circular
circumstance
citizen
civilization
claim
class
classic
clause
clear
client
climate change
climb
climb
closely
cloth
clothing
cloud
clue
clumsy
coach
coaching
coastal
code
coincidence
collapse
collar
collect
collection
collecton
collocation
colon
colourful
column
combination
combine
come
comedian
comfort
comfortable
comfortably
command
comment
commerce
commercial
commit
commitment
committee
common
communicate
communicative
community
companion
company
compare
comparison
compete
competition
competitive
complex
composer
composition
compromise
compulsory
concentration
concept
concern
concerned
concerning
conclusion
concrete
condition
conduct
conductor
confess
confession
confidence
confident
confidently
confirm
confirmation
conflict
confuse
confused
confusion
congratulate
conjunction
connection
conscious
consciousness
consequence
consequently
conservation
consider
considerable
considerably
consideration
considering
constant
constantly
construct
construction
consultant
consume
consumer
contain
contents
context
continuous
continuously
contrary
contrast
contribute
contribution
control
controversial
convenience
conveniently
conventional
convert
convinced
cool
cooperate
cooperation
cooperative
cope
copper
copy
corporation
correct
correspond
corridor
cost
costume
could
council
count
counter
county
courage
course
court
courtesy
cover
coward
cowardly
crab
crack
craft
crash
crawl
crazy
creation
creatively
creativity
credit
crew
criminal
crisis
critic
critical
critically
criticism
criticize
crocodile
cross
crossroads
crucial
cruelly
cruelty
cruise
culturally
cure
curiosity
curiously
current
currently
cursor
curve
cut
cycle
dairy
damp
dare
darkness
darling
dash
data
database
daughter-in-law
dawn
day
daylight
daytime
dead
deadline
deadly
deal
dealer
dear
death
debate
debit
debit card
debt
decade
decay
deceive
decent
decisive
deck
declare
decline
decoration
decorative
deep
deeply
deer
defeat
defend
defender
define
definite
definition
degree
degree
deliberate
delicate
delight
delightful
deliver
demand
demanding
democracy
democratic
demolish
demonstrate
demonstration
denim
dense
densely
dental
deny
depend
dependent
depressing
depression
deprive
depth
descend
design
designer
desirable
desire
desktop
despair
desperate
desperately
despite
destruction
detail
detailed
determination
determined
determiner
develop
developed
developing
development
device
devil
devote
devoted
dialogue
diamond
die
differ
difference
difficulty
dig
dilemma
dimension
dip
diplomat
diplomat
direction
directly
disability
disagreement
disappear
disappearance
disaster
disc
discipline
discourage
discourage
disgrace
disguise
dishonest
dishonesty
dislike
disorganized
disorganised
display
disposal
disrupt
dissatisfaction
dissatisfied
distance
distant
distinction
distinguish
distinguished
distract
distressing
distribute
disturb
diverse
divide
division
divorce
dizzy
do
domestic
dominate
donate
donation
dose
dot
double
doubt
doubtful
down
draft
drag
dramatic
draw into/out/away, etc.
draw (sb's) attention to sth/sb
dreadful
dream
dress
drive
drop
drown
drug
drunk
due
duty
dynamic
eager
eagerly
eagerness
eagle
ear
earn
earnings
earth
earthquake
at ease
east
eastern
eat up
ecological
ecologically
economic
economical
economist
economy
edge
edit
edition
editor
educate
educated
educational
effective
effectively
efficiency
efficiently
egg
eighty
either
elder
eldest
elect
electrician
electronically
electronics
elegant
elegantly
element
else
elsewhere
embarrassment
emerge
emotion
emotional
emotionally
emphasis
emphasize
enable
enclose
encounter
encouragement
encouraging
end
put an end to sth
endangered
endless
endure
enemy
energetic
enjoyment
enough
enquire
ensure
entertainer
entertaining
enthusiasm
enthusiastic
enthusiastically
entire
entirely
entitle
environment
environmentally
environmentally friendly
envy
episode
equal
equality
equally
equip
era
error
escalator
escape
especially
essentially
establish
estate
estimate
estimated
even
eventually
ever
every
everything
evidence
evident
evidently
evil
evolution
exactly
examination
examine
example
exception
exceptional
exchange
exclamation mark
exclusive
excuse
exhausting
exhaustion
existence
existing
exotic
expand
expansion
expect
expectation
expected
expense
experiment
expert
exploit
explore
explosion
export
expose
express
expression
extend
extension
extensive
extent
external
extract
extraordinarily
extreme
eye
eyebrow
eyelash
eyelid
eyesight
face
facility
fact
factor
fade
fail
failure
faint
fair
fairly
faith
faithful
faithfully
fall
fame
familiar
fancy
fantastically
fantasy
far
fascinated
fascinating
fasten
fat
fatal
fate
father-in-law
fault
faulty
favour
favourable
fear
feather
feature
fed up
feedback
feel
feeling
fellow
female
fence
field
fierce
fifty
fight
fighting
figure
fill
finance
financially
find
fine
finely
fingernail
finish
fire
fire brigade
firm
firmly
first
first language
firstly
fisherman
fit
fix
fixed
flame
flash
flat
flexibility
flexible
flood
fluency
fluent
fluently
fly
focus
follow
following
fond
fool
foolish
foolishly
for
forbid
force
foreign
forever
forget
forgive
form
formal
former
formerly
forthcoming
fortunate
fortune
forty
forward
found
fox
frame
frankly
free
freedom
freely
freeze
fresh
friendliness
frighten
from
frost
frustration
full
fun
function
functional
funeral
furious
furiously
further
furthermore
future
gambling
gang
gap
gardener
gardening
gas
gather
gaze
gear
gender




